RomanLut/hx-esp32-cam-fpv/components/esp32-camera/sensors/ov3660.c
    case PIXFORMAT_GRAYSCALE:
        regs = sensor_fmt_grayscale;
        break;

    case PIXFORMAT_RGB565:
    case PIXFORMAT_RGB888:
        regs = sensor_fmt_rgb565;
        break;

    case PIXFORMAT_JPEG:
        regs = sensor_fmt_jpeg;
        break;

    case PIXFORMAT_RAW:
        regs = sensor_fmt_raw;
        break;

    default:
        ESP_LOGE(TAG, "Unsupported pixformat: %u", pixformat);
        return -1;
    }

    ret = write_regs(sensor->slv_addr, regs);
    if(ret == 0) {
        sensor->pixformat = pixformat;
        ESP_LOGD(TAG, "Set pixformat to: %u", pixformat);
    }
    return ret;
}

static int set_image_options(sensor_t *sensor)
{
    int ret = 0;
    uint8_t reg20 = 0;
    uint8_t reg21 = 0;
    uint8_t reg4514 = 0;
    uint8_t reg4514_test = 0;

    // compression
    if (sensor->pixformat == PIXFORMAT_JPEG) {
        reg21 |= 0x20;
    }

    // binning
    if (sensor->status.binning) {
        reg20 |= 0x01;
        reg21 |= 0x01;
        reg4514_test |= 4;
    } else {
        reg20 |= 0x40;
    }

    // V-Flip
    if (sensor->status.vflip) {
        reg20 |= 0x06;
        reg4514_test |= 1;
    }

    // H-Mirror
    if (sensor->status.hmirror) {
        reg21 |= 0x06;
        reg4514_test |= 2;
    }

    switch (reg4514_test) {
        //no binning
        case 0: reg4514 = 0x88; break;//normal
        case 1: reg4514 = 0x88; break;//v-flip
        case 2: reg4514 = 0xbb; break;//h-mirror
        case 3: reg4514 = 0xbb; break;//v-flip+h-mirror
        //binning
        case 4: reg4514 = 0xaa; break;//normal
        case 5: reg4514 = 0xbb; break;//v-flip
        case 6: reg4514 = 0xbb; break;//h-mirror
        case 7: reg4514 = 0xaa; break;//v-flip+h-mirror
    }

    if(write_reg(sensor->slv_addr, TIMING_TC_REG20, reg20)
        || write_reg(sensor->slv_addr, TIMING_TC_REG21, reg21)
        || write_reg(sensor->slv_addr, 0x4514, reg4514)){
        ESP_LOGE(TAG, "Setting Image Options Failed");
        ret = -1;
    }

    if (sensor->status.binning) {
        ret  = write_reg(sensor->slv_addr, 0x4520, 0x0b)
            || write_reg(sensor->slv_addr, X_INCREMENT, 0x31)//odd:3, even: 1
            || write_reg(sensor->slv_addr, Y_INCREMENT, 0x31);//odd:3, even: 1
    } else {
        ret  = write_reg(sensor->slv_addr, 0x4520, 0xb0)
            || write_reg(sensor->slv_addr, X_INCREMENT, 0x11)//odd:1, even: 1
            || write_reg(sensor->slv_addr, Y_INCREMENT, 0x11);//odd:1, even: 1
    }

    ESP_LOGD(TAG, "Set Image Options: Compression: %u, Binning: %u, V-Flip: %u, H-Mirror: %u, Reg-4514: 0x%02x",
        sensor->pixformat == PIXFORMAT_JPEG, sensor->status.binning, sensor->status.vflip, sensor->status.hmirror, reg4514);
    return ret;
}

static int set_framesize(sensor_t *sensor, framesize_t framesize)
{
    int ret = 0;

    // Accept by real dimensions (2048x1536 array) instead of enum order so
    // FRAMESIZE_P_FHD (1024x576, defined in the 5MP enum section) works too.
    if(framesize >= FRAMESIZE_INVALID
        || resolution[framesize].width > 2048 || resolution[framesize].height > 1536){
        ESP_LOGW(TAG, "Invalid framesize: %u", framesize);
        framesize = FRAMESIZE_QXGA;
    }
    framesize_t old_framesize = sensor->status.framesize;
    sensor->status.framesize = framesize;
    uint16_t w = resolution[framesize].width;
    uint16_t h = resolution[framesize].height;
    aspect_ratio_t ratio = resolution[sensor->status.framesize].aspect_ratio;
    ratio_settings_t settings = ratio_table[ratio];
    bool is_1024x576_timing = (framesize == FRAMESIZE_P_FHD);
    bool is_1280x720_timing = (framesize == FRAMESIZE_HD);

    if (is_1024x576_timing) {
        // Use a moderate 1728x972 source for 1024x576. The wider 1920x1080 ->
        // 1024x576 scaler ratio can produce unstable frame pacing on OV3660,
        // while the 1536x864 3:2 path crops too much FOV.
        sensor->status.binning = false;
        sensor->status.scale = true;
        ret  = write_addr_reg(sensor->slv_addr, X_ADDR_ST_H, 160, 282)
            || write_addr_reg(sensor->slv_addr, X_ADDR_END_H, 1919, 1265)
            || write_addr_reg(sensor->slv_addr, X_OUTPUT_SIZE_H, w, h)
            || write_addr_reg(sensor->slv_addr, X_TOTAL_SIZE_H, 1920, 1040)
            || write_addr_reg(sensor->slv_addr, X_OFFSET_H, 16, 6);
    } else if (is_1280x720_timing) {
        // OV3660's generic 16:9 table scans the full 1920x1080 window and tops
        // out near 20 FPS. Keep the active source aligned to the stock 16:9
        // window; odd scaler ratios/crops can corrupt colors on this sensor.
        // It deliberately avoids binning so FOV stays close to the max 16:9 crop.
        sensor->status.binning = false;
        sensor->status.scale = true;
        ret  = write_addr_reg(sensor->slv_addr, X_ADDR_ST_H, 64, 242)
            || write_addr_reg(sensor->slv_addr, X_ADDR_END_H, 2015, 1333)
            || write_addr_reg(sensor->slv_addr, X_OUTPUT_SIZE_H, w, h)
            || write_addr_reg(sensor->slv_addr, X_TOTAL_SIZE_H, 2172, 1128)
            || write_addr_reg(sensor->slv_addr, X_OFFSET_H, 16, 6);
    } else {
        sensor->status.binning = (w <= (settings.max_width / 2) && h <= (settings.max_height / 2));
        sensor->status.scale = !((w == settings.max_width && h == settings.max_height)
            || (w == (settings.max_width / 2) && h == (settings.max_height / 2)));

        ret  = write_addr_reg(sensor->slv_addr, X_ADDR_ST_H, settings.start_x, settings.start_y)
            || write_addr_reg(sensor->slv_addr, X_ADDR_END_H, settings.end_x, settings.end_y)
            || write_addr_reg(sensor->slv_addr, X_OUTPUT_SIZE_H, w, h);

        if (ret) {
            goto fail;
        }

        if (sensor->status.binning) {
            uint16_t total_y = (settings.total_y / 2) + 1;
#if defined(CONFIG_IDF_TARGET_ESP32)
            bool esp32_normal_4x3_vga_svga = sensor->pixformat == PIXFORMAT_JPEG
                && sensor->status.colorbar == 0
                && ratio == ASPECT_RATIO_4X3
                && (framesize == FRAMESIZE_VGA || framesize == FRAMESIZE_SVGA);
            if (esp32_normal_4x3_vga_svga)
            {
                // OV3660 breaks frames on ESP32-CAM at the low VCO 140 setting.
                // Keep the PLL in the stable VCO 180 range and lower the frame
                // cadence by extending VTS instead.
                total_y = 1010;
            }
#endif
            ret  = write_addr_reg(sensor->slv_addr, X_TOTAL_SIZE_H, settings.total_x, total_y)
                || write_addr_reg(sensor->slv_addr, X_OFFSET_H, 8, 2);
        } else {
            ret  = write_addr_reg(sensor->slv_addr, X_TOTAL_SIZE_H, settings.total_x, settings.total_y)
                || write_addr_reg(sensor->slv_addr, X_OFFSET_H, 16, 6);
        }
    }

    if (ret == 0) {
        ret = write_reg_bits(sensor->slv_addr, ISP_CONTROL_01, 0x20, sensor->status.scale);
    }

    if (ret == 0) {
        ret = set_image_options(sensor);
    }

    if (ret) {
        goto fail;
    }

    if (sensor->pixformat == PIXFORMAT_JPEG) {
        //FPS = SYSCLK / (HTS * VTS); binned VTS = total_y/2+1 (see tools/ov3660_pclk_calculator)
        //high FPS variants are selected by the ov5640HighFPS flag passed via set_colorbar()
        bool highFPS = sensor->status.colorbar != 0;
#if defined(CONFIG_IDF_TARGET_ESP32C5)
        //24 MHz XCLK (ESP32-C5)
        if (is_1024x576_timing) {
            ret = set_pll(sensor, false, 10, 1, 0, false, 0, true, 8); //SYSCLK 60 MHz: 1024x576 30.0 FPS, 15 mhz pclk
        } else if (is_1280x720_timing) {
            ret = set_pll(sensor, false, 18, 1, 1, false, 0, true, 6); //SYSCLK 72 MHz: 1280x720 29.4 FPS, 24 mhz pclk
        } else if (sensor->status.binning && highFPS) {
            ret = set_pll(sensor, false, 18, 1, 1, false, 0, true, 6); //SYSCLK 72 MHz: 4:3 40.0 FPS, 16:9 50.1 FPS, 24 mhz pclk
        } else if (sensor->status.binning && ratio == ASPECT_RATIO_16X9) {
            ret = set_pll(sensor, false, 11, 1, 1, false, 0, true, 4); //SYSCLK 44 MHz: 30.6 FPS, 22 mhz pclk
        } else {
            ret = set_pll(sensor, false, 9, 1, 0, false, 0, true, 4); //SYSCLK 54 MHz: 4:3 binned 30.0 FPS, QXGA 15.0 FPS, 16:9 full 20.5 FPS, 27 mhz pclk
        }
#elif defined(CONFIG_IDF_TARGET_ESP32S3)
        //20 MHz XCLK (ESP32-S3, PCLK capture limit 40 MHz)
        if (is_1024x576_timing) {
            ret = set_pll(sensor, false, 12, 1, 0, false, 0, true, 8); //SYSCLK 60 MHz: 1024x576 30.0 FPS, 15 mhz pclk
        } else if (is_1280x720_timing) {
            ret = set_pll(sensor, false, 29, 1, 2, false, 0, true, 6); //SYSCLK 72.5 MHz: 1280x720 29.6 FPS, 24.2 mhz pclk
        } else if (sensor->status.binning && highFPS) {
            ret = set_pll(sensor, false, 29, 1, 2, false, 0, true, 6); //SYSCLK 72.5 MHz: 4:3 40.3 FPS, 16:9 50.4 FPS, 24.2 mhz pclk
        } else if (sensor->status.binning && ratio == ASPECT_RATIO_16X9) {
            ret = set_pll(sensor, false, 13, 1, 1, false, 0, true, 4); //SYSCLK 43.3 MHz: 30.1 FPS, 21.7 mhz pclk
        } else {
            ret = set_pll(sensor, false, 11, 1, 0, false, 0, true, 4); //SYSCLK 55 MHz: 4:3 binned 30.5 FPS, QXGA 15.3 FPS, 16:9 full 20.9 FPS, 27.5 mhz pclk
        }
#elif defined(CONFIG_IDF_TARGET_ESP32)
        //20 MHz XCLK (ESP32): keep VGA/SVGA normal 4:3 near 19.4 FPS using
        //stable VCO 180 timing; VCO 140 produced broken frames on ESP32-CAM.
        if (is_1024x576_timing)
        {
            ret = set_pll(sensor, false, 12, 1, 0, false, 0, true, 8); //SYSCLK 60 MHz: 1024x576 30.0 FPS, 15 mhz pclk
        }
        else if (is_1280x720_timing)
        {
            ret = set_pll(sensor, false, 11, 1, 0, false, 0, true, 8); //SYSCLK 55 MHz: 1280x720 22.5 FPS, 13.75 mhz pclk
        }
        else if (sensor->status.binning && highFPS)
        {
            ret = set_pll(sensor, false, 29, 1, 2, false, 0, true, 15); //VCO 290! SYSCLK 72.5 MHz: 4:3 40.3 FPS, 16:9 50.4 FPS, 9.7 mhz pclk
        }
        else if (sensor->status.binning && ratio == ASPECT_RATIO_16X9)
        {
            ret = set_pll(sensor, false, 13, 1, 1, false, 0, true, 9); //VCO 173, SYSCLK 43.3 MHz: 30.1 FPS, 9.6 mhz pclk
        }
        else if (sensor->status.binning && !highFPS && ratio == ASPECT_RATIO_4X3
            && (framesize == FRAMESIZE_VGA || framesize == FRAMESIZE_SVGA))
        {
            ret = set_pll(sensor, false, 9, 1, 0, false, 0, true, 9); //VCO 180, SYSCLK 45 MHz: 4:3 binned 19.4 FPS with VTS=1010, 10 mhz pclk
        }
        else
        {
            ret = set_pll(sensor, false, 11, 1, 0, false, 0, true, 4); //SYSCLK 55 MHz: 4:3 binned 30.5 FPS, QXGA 15.3 FPS, 16:9 full 20.9 FPS, 27.5 mhz pclk
        }
#else
        //legacy: 40MHz SYSCLK and 10MHz PCLK
        ret = set_pll(sensor, false, 24, 1, 3, false, 0, true, 8);
#endif
    } else {
        //tuned for 16MHz XCLK and 8MHz PCLK
        if (framesize > FRAMESIZE_HVGA) {
            //8MHz SYSCLK and 8MHz PCLK (4.44 FPS)
            ret = set_pll(sensor, false, 4, 1, 0, false, 2, true, 2);
        } else if (framesize >= FRAMESIZE_QVGA) {
            //16MHz SYSCLK and 8MHz PCLK (10.25 FPS)
            ret = set_pll(sensor, false, 8, 1, 0, false, 2, true, 4);
        } else {
            //32MHz SYSCLK and 8MHz PCLK (17.77 FPS)
            ret = set_pll(sensor, false, 8, 1, 0, false, 0, true, 8);
        }
    }

    if (ret == 0) {
        ESP_LOGD(TAG, "Set framesize to: %ux%u", w, h);
    }
    return ret;

